Autodesk.Revit.DB.TemporaryGraphicsManager.SetTooltip(System.Int32,System.String)
Sets the tooltip for the temporary graphics object.
index:
Unique index of the temporary graphics object to be updated.
tooltip:
Tooltip to be set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is out of range of TemporaryGraphicsManager managed objects, or the indexed object has been removed from the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026